#### Terraform Format and Style :pencil2: :white_check_mark: **Success**
#### Terraform Validate :hammer_and_wrench: :white_check_mark: **Success**
#### TFLint Check :shirt: :white_check_mark: **Success**
#### Trivy Scan :shield: :white_check_mark: **Success**
#### Terraform Plan :page_facing_up: :white_check_mark: **Success**
---
### Terraform Plan
<details><summary>Click to expand</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.application-autoscaling.aws_appautoscaling_policy.ecs_cpu_target will be created
  + resource "aws_appautoscaling_policy" "ecs_cpu_target" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "sample-prod-frontend-ecs-cpu-target"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/sample-prod-frontend-ecs-cluster/sample-prod-frontend-svc"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 300
          + target_value       = 60

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.application-autoscaling.aws_appautoscaling_policy.ecs_memory_target will be created
  + resource "aws_appautoscaling_policy" "ecs_memory_target" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "sample-prod-frontend-ecs-memory-target"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/sample-prod-frontend-ecs-cluster/sample-prod-frontend-svc"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 300
          + target_value       = 60

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.application-autoscaling.aws_appautoscaling_target.ecs_service will be created
  + resource "aws_appautoscaling_target" "ecs_service" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 3
      + min_capacity       = 2
      + resource_id        = "service/sample-prod-frontend-ecs-cluster/sample-prod-frontend-svc"
      + role_arn           = "arn:aws:iam::551748907504:role/aws-service-role/ecs.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_ECSService"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = {
          + "iac" = "terraform"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>